import Section from "../layout/section";

export default function Introduction() {
	return (
		<Section
			title="자기소개"
			nodes={
				<p>
					배움이 빠르고 효율적인 것을 좋아하고 React, Next.js, JavsScript, TypeScript, Node.js를 주로
					사용하는 3년차 풀스택 개발자 유채형입니다. 바로 보여지고 느껴지는 것을
					더 좋아하여 생명과학 연구원 보다는 개발자의 길을 선택했고, 풀스택 개발자보다는
					프론트엔드 개발자가 되고 싶습니다. 2022년 현재 재직 중인 회사에
					다니면서 부터 React, Next.js 개발을 시작하여 총 6개의 프로젝트에서 프론트엔드 경험이 있습니다.
					2023년 초부터는 주도적으로 프로젝트를 진행하였고, 좋은 성과를 내어 역량을 인정 받아 
					총 경력 2년 8개월만에 대리로 진급하였습니다. 진급 심사
					당시 부여된 업무에 대해 충분히 고민하고 피드백이 탁월하며 침착하고
					차분하게 분석하며 방법을 찾아내는 강점에 대한 긍정적인 평가가
					있었습니다. 최근에는 기능을 잘 구현하는 개발자에서 사용자 경험에 대해
					고민하는 개발자로 성장하고자 노력하고 있습니다.
				</p>
			}
		/>
	);
}
