import Section from "../layout/section";

export default function Introduction() {
	return (
		<Section
			title="자기소개"
			nodes={
				<p>
					2021년 3월부터 개발자로 일하여 총 3년 4개월의 경력을 가지고 있습니다. 
					2022년 3월부터 디지털 헬스케어 회사에서 6개의 프로젝트에 참여하였습니다. 
					JavaScript, TypScript, React, Next.js, Node.js를 주기술로 보유하고 있습니다.
					개발자로서 배움과 피드백이 빠르다는 강점을 가지고 있습니다. 
					2023년 초부터 강점을 잘 활용하여 프로젝트를 주도적으로 이끌어 챗봇빌더 프로젝트를 
					성공적으로 완성시키는 등 좋은 성과를 내었습니다. 
					그 결과, 팀에서 일을 믿고 맡기는 사람에 되었으며 총 경력 2년 8개월 만에 대리로 진급하였습니다.
					최근에는 기능을 잘 구현하는 개발자에서 사용자 경험에 대해
					고민하는 개발자로 성장하고자 노력하고 있습니다.
				</p>
			}
		/>
	);
}
